;;; packages.el --- editor packages -*- lexical-binding: t; -*-
;;; Commentary:
;; Package declarations for the editor module.
;;; Code:

(package! evil)
(package! evil-collection)
(package! evil-commentary)
(package! evil-surround)
(package! yasnippet)
(package! yasnippet-snippets)
(package! ws-butler)
(package! undo-tree)
(package! hungry-delete)

;;; packages.el ends here
